# Join Statements - Lab

## Introduction

In this lab, you'll practice your knowledge of `JOIN` statements, using various types of joins and various methods for specifying the links between them.

## Objectives

You will be able to:
* Write SQL queries that make use of various types of joins
* Compare and contrast the various types of joins
* Discuss how primary and foreign keys are used in SQL
* Decide and perform whichever type of join is best for retrieving desired data

## CRM ERD

In this lab, you'll use the same customer relationship management (CRM) database that you saw from the previous lesson.
<img src='images/Database-Schema.png' width="600">

## Connecting to the Database
Import the necessary packages and connect to the database `'data.sqlite'`.

In [1]:
# Your code here
import pandas as pd
import sqlite3

conn = sqlite3.connect('data.sqlite')

## Select the names of all employees in Boston 

Hint: join the employees and offices tables. Select the first and last name.

In [7]:
# Your code here
q = """
SELECT e.lastName, e.firstName
  FROM employees e
  JOIN offices o
     USING(officeCode)
 WHERE city = 'Boston'
;
"""

pd.read_sql(q, conn)

    lastName firstName
0   Firrelli     Julie
1  Patterson     Steve

## Are there any offices that have zero employees?
Hint: Combine the employees and offices tables and use a group by. Select the office code, city, and number of employees.

In [17]:
# Your code here

q = '''
SELECT o.officeCode, o.city, COUNT(e.employeeNumber) AS n_employees
  FROM offices o
  LEFT JOIN employees e
     ON o.officeCode = e.officecode
 GROUP BY o.officeCode
HAVING n_employees = 0
;
'''

pd.read_sql(q, conn)

   officeCode           city  n_employees
0           1  San Francisco            6
1           2         Boston            2
2           3            NYC            2
3           4          Paris            5
4           5          Tokyo            2
5           6         Sydney            4
6           7         London            2
7          27         Boston            0

## Write 3 questions of your own and answer them

In [ ]:
# Answers will vary

# Example question: 
"""
How many customers are there per office?
"""

In [21]:
"""
How many orders has each customer placed (ordered by most orders first)?
"""

q = """
SELECT c.customerNumber, c.customerName, COUNT(orderNumber) as n_orders
  FROM customers c
  JOIN orders o
     ON c.customerNumber = o.customerNumber
 GROUP BY c.customerNumber
 ORDER BY n_orders DESC
;
"""

pd.read_sql(q, conn)

    customerNumber                        customerName  n_orders
0              141              Euro+ Shopping Channel        26
1              124        Mini Gifts Distributors Ltd.        17
2              353                  Reims Collectables         5
3              323          Down Under Souveniers, Inc         5
4              148             Dragon Souveniers, Ltd.         5
..             ...                                 ...       ...
93             189             Clover Collections, Co.         2
94             177                Osaka Souveniers Co.         2
95             173          Cambridge Collectables Co.         2
96             171            Daedalus Designs Imports         2
97             415  Bavarian Collectables Imports, Co.         1

[98 rows x 3 columns]

In [24]:
"""
Show the product lines where there are less than 10w products
"""
# using the productlines and products tables
# using a left join to ensure that all product lines are included
# Your code here
q = '''
SELECT productLine, COUNT(productCode) AS n_products
  FROM productlines pl
  LEFT JOIN products p
     USING(productLine)
 GROUP BY pl.productLine
HAVING n_products < 10
;
'''

pd.read_sql(q, conn)

  productLine  n_products
0       Ships           9
1      Trains           3

In [28]:
"""
Question 3

Show all orders and how big the discount on each one was in descending order
"""
# Using orderdetails and products tables
# Your code here

q = """
SELECT o.orderNumber, p.productName, o. p.MSRP - o.priceEach AS discount_amt 
  FROM orderdetails o
  LEFT JOIN products p
     ON o.productcode = p.productcode
 ORDER BY discount_amt DESC
;
"""

pd.read_sql(q, conn)

      orderNumber                                productName  discount_amt
0           10270                   1952 Alpine Renault 1300         42.86
1           10142                          2001 Ferrari Enzo         41.56
2           10176                          2001 Ferrari Enzo         41.56
3           10382                          2001 Ferrari Enzo         41.56
4           10165                          2001 Ferrari Enzo         39.48
...           ...                                        ...           ...
2991        10408           1936 Mercedes Benz 500k Roadster          0.00
2992        10413                           1969 Ford Falcon          0.00
2993        10414                                 Pont Yacht          0.00
2994        10421  1938 Cadillac V-16 Presidential Limousine          0.00
2995        10425                   1962 Volkswagen Microbus          0.00

[2996 rows x 3 columns]

## Level Up 1: Display the names of every individual product that each employee has sold

Hint: You will need to use multiple `JOIN` clauses to connect all the way from employee names to product names.

In [ ]:
# Your code here

## Level Up 2: Display the number of products each employee has sold

Alphabetize the results by employee last name.

Hint: Use the `quantityOrdered` column from `orderDetails`. Also, think about how to group the data when some employees might have the same first or last name.

In [ ]:
# Your code here

## Level Up 3: Display the names employees who have sold more than 200 different products

Hint: this is different from the previous question because the quantity sold doesn't matter, only the number of different products

In [ ]:
# Your code here

## Summary

Congrats! You practiced using join statements and leveraged your foreign keys knowledge!